{"title": "Chainsaw man review... MID?", "author": "Maouuu", "content": "Im sorry if i offend everyone. So if you dont wanna be offended stop reading now.\r\n\r\nThis show is incredibly mid. when i say mid i dont mean that in a bad way. im saying its not bad and its not good. I feel word mid lost its meaning. From the 2 episodes i watched. i cant bring myself to even watch one more episode. I honestly cant. its simply so predictable. i already know makima is evil. she probably killed a bunch of people for her goal. and she manipulates denji and the other characters to the extreme to achieve her goal.. some might say this will be a big plot twist. but its honestly not. Sure from a character that you thought was good for along time, and then turn bad, sure its pretty interesting plot twist. ive seen better tho. as a novelist myself the story doesn't have any substance to keep watching. maybe it starts to get good a little later, but if it doesn't start of interesting and it takes a whole season to actually get good? then i cant view that as a good show.\r\n\r\nand i feel like the manga might be quite better. i feel like the characters are trying to read a script. could be a problem with the voice actors. not only that but it doesn't feel like anime. the fluid motions looks awful. at lest for now. maybe down the line they will perfect it. also the sounds and music is off. way to much silence, in some areas the music is way to loud, and in some way to quite. this might seem like a needy critic, but if not done correctly, it makes the show unwatchable.\r\n\r\nin some areas i actually liked the comedy. but with the things like the music, sound-effects and ect. It felt very lackluster. if it was done correctly i would enjoyed it a lot.\r\n\r\nand also the GORE. this is the thing i hate about this show the most. I DONT MIND GORE. but i feel there trying to be edgy for no reason. its honestly quite annoying and repetitive.\r\n\r\nlook at this, ive been getting into full metal alchemist brotherhood. and even being out dated a full 10 YEARS the music and the scenes are far more better. and im comparing the first 2 episodes against each-other. and this is a completely unbiased opinion, because im still watching ( full metal ) so im not drived by nostalgia or the hype.\r\n\r\nalright if you read my review fully. are actually a decent human being, with a open mind. AGAIN THIS IS MY OPINION.", "subreddit": "Anime", "likes": 3, "id": 1}
{"title": "Romance manga with Gloomy male MC?", "author": "Maouuu", "content": "Pls im desperate.\r\n\r\n", "subreddit": "Manga", "likes": 1}
{"title": "Mount Hua", "author": "Maouuu", "content": "Check out this new cover for mount hua!", "subreddit": "Anime", "likes": 1, "image_url": "https://meo.comick.pictures/r16NG.jpg"}
{"title": "vsvsv", "author": "Anonymous", "content": "vsvsv", "subreddit": "Manga", "likes": 1, "image_url": "https://meo3.comick.pictures/19-vKgB1zt7qfgYx-m.jpg"}
{"title": "comments test", "author": "Anonymous", "content": "test foir nested comments", "subreddit": "test", "likes": 1, "image_url": "", "comments": []}
{"title": "dwdwdw", "author": "Anonymous", "content": "dwdwdw", "subreddit": "Anime", "likes": 1, "image_url": "", "comments": []}
{"title": "fyjyhfyfukyhfk", "author": "wussyslayer", "content": "jxtdyrdtytdytdy", "subreddit": "Anime", "likes": 1, "image_url": "", "comments": []}
{"title": "test 2", "author": "wussyslayer", "content": "NESTED TEST 2", "subreddit": "test", "likes": 1, "image_url": "", "comments": []}
